%逐步回归
clc;clear all
x1 = [7 1 11 11 7 11 3 1 2 21 1 11 10]';   %四种成分对y的影响
x2 = [26 28 56 31 52 55 71 31 54 47 40 66 68]';
x3 = [6 15 8 8 6 9 17 22 18 4 23 9 8]';
x4 = [60 52 20 47 33 22 6 44 22 26 34 12 12]';
y = [78.5 74.3 104.3 87.6 95.9 109.2 102.7 72.5 93.1 115.9  83.8 113.3 109.4]';
x = [x1 x2 x3 x4];

%对变量y和x1,x2作线性回归
X = [ones(13,1),x1,x2];
b = regress(y,X);    %相关系数越接近于1越好   F越大越好  RMES越小越好
stepwise(x,y); %指令不要与函数名重    生成图像后点Next 变灰后  点export 输出参数
% X=(ones(13,1),x2,x3); b=regress(y,X);